{
  "id": "jandy-versatemp-errors-v1",
  "title": "Jandy VersaTemp Heat Pump — Error Codes",
  "errors": [
    {
      "code": "FAULT-NO_FLOW",
      "title": "No water flow",
      "meaning": "Low or restricted water flow through the heat pump. External bypass valve may be in the wrong position, or the water flow switch has malfunctioned.",
      "fix": "Verify circulating pump is ON, valves are open, filters and skimmers are clean, and water level is adequate."
    },
    {
      "code": "FAULT-LOW_REF_PRESSURE",
      "title": "Low refrigerant pressure",
      "meaning": "When ambient temperature is low, suction pressure can drop significantly. The low-pressure switch opens and shuts off the compressor.",
      "fix": "Check fan operation (air blowing out top). May be normal if pool water is below 50°F. Call for service if persists."
    },
    {
      "code": "FAULT-HIGH_REF_PRESSURE",
      "title": "High refrigerant pressure",
      "meaning": "Head pressure built too high, causing the high-pressure switch to open. The compressor shuts off until pressure normalizes.",
      "fix": "Check pump and valves for restrictions. Clean filters and skimmers. Increase pump speed if variable-speed. Cycle power up to 3 times; call for service if persists."
    },
    {
      "code": "FAULT-HIGH_WATER_TEMP",
      "title": "High water temperature",
      "meaning": "Water temp reached maximum allowed. Thermostat shuts off unless in CHILLER mode. Prevents dangerously high temps from sensor malfunction.",
      "fix": "Verify sensors, cool water, or switch to CHILLER mode. Replace faulty sensors if needed."
    },
    {
      "code": "FAULT-COIL_SENSOR",
      "title": "Coil sensor fault",
      "meaning": "The coil temperature sensor is malfunctioning or not connected.",
      "fix": "Inspect wiring, reconnect if loose, or replace coil sensor."
    },
    {
      "code": "FAULT-WATER_SENSOR",
      "title": "Water sensor fault",
      "meaning": "The water temperature sensor is malfunctioning or not connected.",
      "fix": "Inspect wiring, reconnect if loose, or replace water sensor."
    }
  ]
}